= sdbcli

== Description

sdbcli is an interactive command-line client of Amazon SimpleDB.

== Source Code

https://bitbucket.org/winebarrel/sdbcli

== Install

  shell> gem install sdbcli
  shell> export AWS_ACCESS_KEY_ID='...'
  shell> export AWS_SECRET_ACCESS_KEY='...'
  shell> export SDB_ENDPOINT='sdb.ap-northeast-1.amazonaws.com'
  shell> sdbcli

== Example

  ap-northeast-1> help
  SHOW domains
    displays a domain list
  
  CREATE domain domain_name
    creates a domain
  
  DROP DOMAIN domain_name
    deletes a domain
  
  GET [output_list] FROM domain_name WHERE itemName = '...'
    gets the attribute of an item
  
  INSERT INTO domain_name (itemName, attr1, ...) values ('name', 'val1', ...)
    creates an item
  
  UPDATE domain_name set attr1 = 'val1', ... where itemName = '...'
    updates an item
  
  DELETE [attr1, ...] FROM domain_name itemName = '...'
    deletes the attribute of an item or an item
  
  SELECT output_list FROM domain_name [where expression] [sort_instructions] [limit limit]
    queries using the SELECT statement
  
  ap-northeast-1> select * from test
  ---
  - [itemname1, {attr1: val1, attr2: val2}]
  - [itemname2, {attr1: val1, attr2: val2}]
  
  ap-northeast-1> select * from test \G
  ---
  - - itemname1
    - attr1: val1
      attr2: val2
    - itemname2
    - attr1: val1
      attr2: val2


  shell> echo 'select * from test' | sdbcli
  ---
  - [itemname1, {attr1: val1, attr2: val2}]
  - [itemname2, {attr1: val1, attr2: val2}]

