= sdbcli

== Description

sdbcli is an interactive command-line client of Amazon SimpleDB.

== Source Code

https://bitbucket.org/winebarrel/sdbcli

== Install

  shell> gem install sdbcli
  shell> sdbcli -h
  Usage: sdbcli [options]
      -k, --access-key=ACCESS_KEY
      -s, --secret-key=SECRET_KEY
      -r, --region=REGION
      -e, --eval=COMMAND
  shell> export AWS_ACCESS_KEY_ID='...'
  shell> export AWS_SECRET_ACCESS_KEY='...'
  shell> export SDB_ENDPOINT='sdb.ap-northeast-1.amazonaws.com' # or REGION_NAME=ap-northeast-1
  shell> sdbcli -e 'show domains'
  ---
  - test
  - test-2
  shell> sdbcli # show prompt

== Example

  ap-northeast-1> .help
  SHOW domains
    displays a domain list
  
  CREATE domain domain_name
    creates a domain
  
  DROP DOMAIN domain_name
    deletes a domain
  
  GET [attr_list] FROM domain_name WHERE itemName = '...'
    gets the attribute of an item
  
  INSERT INTO domain_name (itemName, attr1, ...) values ('name', 'val1', ...)
    creates an item
  
  UPDATE domain_name set attr1 = 'val1', ... where itemName = '...'
    updates an item
  
  DELETE [attr1, ...] FROM domain_name itemName = '...'
    deletes the attribute of an item or an item
  
  SELECT output_list FROM domain_name [where expression] [sort_instructions] [limit limit]
    queries using the SELECT statement
  
  DESC domain_name
    displays information about the domain;
  
  ap-northeast-1> select * from test;
  ---
  - [itemname1, {attr1: val1, attr2: val2}]
  - [itemname2, {attr1: val1, attr2: val2}]
  
  ap-northeast-1> select count(*) from `test-2`;
  ---
  - [Domain, {Count: "100"}]

Attribute and domain names may appear without quotes if they contain only letters, numbers, underscores (_), 
or dollar symbols ($) and do not start with a number.
You must quote all other attribute and domain names with the backtick (`).
see http://docs.amazonwebservices.com/AmazonSimpleDB/latest/DeveloperGuide/QuotingRulesSelect.html
  
  ap-northeast-1> select * from test \G
  ---
  - - itemname1
    - attr1: val1
      attr2: val2
    - itemname2
    - attr1: val1
      attr2: val2
  
  shell> echo 'select * from test' | sdbcli
  ---
  - [itemname1, {attr1: val1, attr2: val2}]
  - [itemname2, {attr1: val1, attr2: val2}]
